garyPenhook/PIC-Assembler/device_includes/pic16f17524.inc
// Register: CPCON
#define CPCON CPCON
CPCON                                    equ 020Dh
// bitfield definitions
CPCON_CPRDY_POSN                         equ 0000h
CPCON_CPRDY_POSITION                     equ 0000h
CPCON_CPRDY_SIZE                         equ 0001h
CPCON_CPRDY_LENGTH                       equ 0001h
CPCON_CPRDY_MASK                         equ 0001h
CPCON_CPT_POSN                           equ 0001h
CPCON_CPT_POSITION                       equ 0001h
CPCON_CPT_SIZE                           equ 0001h
CPCON_CPT_LENGTH                         equ 0001h
CPCON_CPT_MASK                           equ 0002h
CPCON_CPREQ_POSN                         equ 0002h
CPCON_CPREQ_POSITION                     equ 0002h
CPCON_CPREQ_SIZE                         equ 0001h
CPCON_CPREQ_LENGTH                       equ 0001h
CPCON_CPREQ_MASK                         equ 0004h
CPCON_CPOS_POSN                          equ 0005h
CPCON_CPOS_POSITION                      equ 0005h
CPCON_CPOS_SIZE                          equ 0001h
CPCON_CPOS_LENGTH                        equ 0001h
CPCON_CPOS_MASK                          equ 0020h
CPCON_CPON_POSN                          equ 0006h
CPCON_CPON_POSITION                      equ 0006h
CPCON_CPON_SIZE                          equ 0002h
CPCON_CPON_LENGTH                        equ 0002h
CPCON_CPON_MASK                          equ 00C0h

// Register: VLPCON
#define VLPCON VLPCON
VLPCON                                   equ 020Eh
// bitfield definitions
VLPCON_VLPDOP_POSN                       equ 0000h
VLPCON_VLPDOP_POSITION                   equ 0000h
VLPCON_VLPDOP_SIZE                       equ 0001h
VLPCON_VLPDOP_LENGTH                     equ 0001h
VLPCON_VLPDOP_MASK                       equ 0001h
VLPCON_VLPDSEL_POSN                      equ 0001h
VLPCON_VLPDSEL_POSITION                  equ 0001h
VLPCON_VLPDSEL_SIZE                      equ 0001h
VLPCON_VLPDSEL_LENGTH                    equ 0001h
VLPCON_VLPDSEL_MASK                      equ 0002h
VLPCON_VLPRDY_POSN                       equ 0005h
VLPCON_VLPRDY_POSITION                   equ 0005h
VLPCON_VLPRDY_SIZE                       equ 0001h
VLPCON_VLPRDY_LENGTH                     equ 0001h
VLPCON_VLPRDY_MASK                       equ 0020h
VLPCON_VLPDACEN_POSN                     equ 0006h
VLPCON_VLPDACEN_POSITION                 equ 0006h
VLPCON_VLPDACEN_SIZE                     equ 0001h
VLPCON_VLPDACEN_LENGTH                   equ 0001h
VLPCON_VLPDACEN_MASK                     equ 0040h
VLPCON_VLPEN_POSN                        equ 0007h
VLPCON_VLPEN_POSITION                    equ 0007h
VLPCON_VLPEN_SIZE                        equ 0001h
VLPCON_VLPEN_LENGTH                      equ 0001h
VLPCON_VLPEN_MASK                        equ 0080h

// Register: VLPDACV
#define VLPDACV VLPDACV
VLPDACV                                  equ 020Fh
// bitfield definitions
VLPDACV_VLPDACV_POSN                     equ 0000h
VLPDACV_VLPDACV_POSITION                 equ 0000h
VLPDACV_VLPDACV_SIZE                     equ 0006h
VLPDACV_VLPDACV_LENGTH                   equ 0006h
VLPDACV_VLPDACV_MASK                     equ 003Fh
VLPDACV_VLPDACV0_POSN                    equ 0000h
VLPDACV_VLPDACV0_POSITION                equ 0000h
VLPDACV_VLPDACV0_SIZE                    equ 0001h
VLPDACV_VLPDACV0_LENGTH                  equ 0001h
VLPDACV_VLPDACV0_MASK                    equ 0001h
VLPDACV_VLPDACV1_POSN                    equ 0001h
VLPDACV_VLPDACV1_POSITION                equ 0001h
VLPDACV_VLPDACV1_SIZE                    equ 0001h
VLPDACV_VLPDACV1_LENGTH                  equ 0001h
VLPDACV_VLPDACV1_MASK                    equ 0002h
VLPDACV_VLPDACV2_POSN                    equ 0002h
VLPDACV_VLPDACV2_POSITION                equ 0002h
VLPDACV_VLPDACV2_SIZE                    equ 0001h
VLPDACV_VLPDACV2_LENGTH                  equ 0001h
VLPDACV_VLPDACV2_MASK                    equ 0004h
VLPDACV_VLPDACV3_POSN                    equ 0003h
VLPDACV_VLPDACV3_POSITION                equ 0003h
VLPDACV_VLPDACV3_SIZE                    equ 0001h
VLPDACV_VLPDACV3_LENGTH                  equ 0001h
VLPDACV_VLPDACV3_MASK                    equ 0008h
VLPDACV_VLPDACV4_POSN                    equ 0004h
VLPDACV_VLPDACV4_POSITION                equ 0004h
VLPDACV_VLPDACV4_SIZE                    equ 0001h
VLPDACV_VLPDACV4_LENGTH                  equ 0001h
VLPDACV_VLPDACV4_MASK                    equ 0010h
VLPDACV_VLPDACV5_POSN                    equ 0005h
VLPDACV_VLPDACV5_POSITION                equ 0005h
VLPDACV_VLPDACV5_SIZE                    equ 0001h
VLPDACV_VLPDACV5_LENGTH                  equ 0001h
VLPDACV_VLPDACV5_MASK                    equ 0020h

// Register: ZCDCON
#define ZCDCON ZCDCON
ZCDCON                                   equ 021Fh
// bitfield definitions
ZCDCON_INTN_POSN                         equ 0000h
ZCDCON_INTN_POSITION                     equ 0000h
ZCDCON_INTN_SIZE                         equ 0001h
ZCDCON_INTN_LENGTH                       equ 0001h
ZCDCON_INTN_MASK                         equ 0001h
ZCDCON_INTP_POSN                         equ 0001h
ZCDCON_INTP_POSITION                     equ 0001h
ZCDCON_INTP_SIZE                         equ 0001h
ZCDCON_INTP_LENGTH                       equ 0001h
ZCDCON_INTP_MASK                         equ 0002h
ZCDCON_POL_POSN                          equ 0004h
ZCDCON_POL_POSITION                      equ 0004h
ZCDCON_POL_SIZE                          equ 0001h
ZCDCON_POL_LENGTH                        equ 0001h
ZCDCON_POL_MASK                          equ 0010h
ZCDCON_OUT_POSN                          equ 0005h
ZCDCON_OUT_POSITION                      equ 0005h
ZCDCON_OUT_SIZE                          equ 0001h
ZCDCON_OUT_LENGTH                        equ 0001h
ZCDCON_OUT_MASK                          equ 0020h
ZCDCON_SEN_POSN                          equ 0007h
ZCDCON_SEN_POSITION                      equ 0007h
ZCDCON_SEN_SIZE                          equ 0001h
ZCDCON_SEN_LENGTH                        equ 0001h
ZCDCON_SEN_MASK                          equ 0080h
ZCDCON_ZCDINTN_POSN                      equ 0000h
ZCDCON_ZCDINTN_POSITION                  equ 0000h
ZCDCON_ZCDINTN_SIZE                      equ 0001h
ZCDCON_ZCDINTN_LENGTH                    equ 0001h
ZCDCON_ZCDINTN_MASK                      equ 0001h
ZCDCON_ZCDINTP_POSN                      equ 0001h
ZCDCON_ZCDINTP_POSITION                  equ 0001h
ZCDCON_ZCDINTP_SIZE                      equ 0001h
ZCDCON_ZCDINTP_LENGTH                    equ 0001h
ZCDCON_ZCDINTP_MASK                      equ 0002h
ZCDCON_ZCDPOL_POSN                       equ 0004h
ZCDCON_ZCDPOL_POSITION                   equ 0004h
ZCDCON_ZCDPOL_SIZE                       equ 0001h
ZCDCON_ZCDPOL_LENGTH                     equ 0001h
ZCDCON_ZCDPOL_MASK                       equ 0010h
ZCDCON_ZCDOUT_POSN                       equ 0005h
ZCDCON_ZCDOUT_POSITION                   equ 0005h
ZCDCON_ZCDOUT_SIZE                       equ 0001h
ZCDCON_ZCDOUT_LENGTH                     equ 0001h
ZCDCON_ZCDOUT_MASK                       equ 0020h
ZCDCON_ZCDSEN_POSN                       equ 0007h
ZCDCON_ZCDSEN_POSITION                   equ 0007h
ZCDCON_ZCDSEN_SIZE                       equ 0001h
ZCDCON_ZCDSEN_LENGTH                     equ 0001h
ZCDCON_ZCDSEN_MASK                       equ 0080h

