garyPenhook/PIC-Assembler/device_includes/pic16f17524.inc
// Register: CK1PPS
#define CK1PPS CK1PPS
CK1PPS                                   equ 01E41h
// bitfield definitions
CK1PPS_CK1PPS_POSN                       equ 0000h
CK1PPS_CK1PPS_POSITION                   equ 0000h
CK1PPS_CK1PPS_SIZE                       equ 0007h
CK1PPS_CK1PPS_LENGTH                     equ 0007h
CK1PPS_CK1PPS_MASK                       equ 007Fh

// Register: RX1PPS
#define RX1PPS RX1PPS
RX1PPS                                   equ 01E42h
// bitfield definitions
RX1PPS_RX1PPS_POSN                       equ 0000h
RX1PPS_RX1PPS_POSITION                   equ 0000h
RX1PPS_RX1PPS_SIZE                       equ 0007h
RX1PPS_RX1PPS_LENGTH                     equ 0007h
RX1PPS_RX1PPS_MASK                       equ 007Fh

// Register: CK2PPS
#define CK2PPS CK2PPS
CK2PPS                                   equ 01E43h
// bitfield definitions
CK2PPS_CK2PPS_POSN                       equ 0000h
CK2PPS_CK2PPS_POSITION                   equ 0000h
CK2PPS_CK2PPS_SIZE                       equ 0007h
CK2PPS_CK2PPS_LENGTH                     equ 0007h
CK2PPS_CK2PPS_MASK                       equ 007Fh

// Register: RX2PPS
#define RX2PPS RX2PPS
RX2PPS                                   equ 01E44h
// bitfield definitions
RX2PPS_RX2PPS_POSN                       equ 0000h
RX2PPS_RX2PPS_POSITION                   equ 0000h
RX2PPS_RX2PPS_SIZE                       equ 0007h
RX2PPS_RX2PPS_LENGTH                     equ 0007h
RX2PPS_RX2PPS_MASK                       equ 007Fh

// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 01E47h
// bitfield definitions
SSP1CLKPPS_SSP1CLKPPS_POSN               equ 0000h
SSP1CLKPPS_SSP1CLKPPS_POSITION           equ 0000h
SSP1CLKPPS_SSP1CLKPPS_SIZE               equ 0007h
SSP1CLKPPS_SSP1CLKPPS_LENGTH             equ 0007h
SSP1CLKPPS_SSP1CLKPPS_MASK               equ 007Fh
SSP1CLKPPS_SSP1CLKPPS0_POSN              equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_POSITION          equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_MASK              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSN              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSITION          equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_MASK              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSN              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSITION          equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_MASK              equ 0004h
SSP1CLKPPS_SSP1CLKPPS3_POSN              equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_POSITION          equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_MASK              equ 0008h
SSP1CLKPPS_SSP1CLKPPS4_POSN              equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_POSITION          equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_MASK              equ 0010h
SSP1CLKPPS_SSP1CLKPPS5_POSN              equ 0005h
SSP1CLKPPS_SSP1CLKPPS5_POSITION          equ 0005h
SSP1CLKPPS_SSP1CLKPPS5_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS5_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS5_MASK              equ 0020h

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 01E48h
// bitfield definitions
SSP1DATPPS_SSP1DATPPS_POSN               equ 0000h
SSP1DATPPS_SSP1DATPPS_POSITION           equ 0000h
SSP1DATPPS_SSP1DATPPS_SIZE               equ 0007h
SSP1DATPPS_SSP1DATPPS_LENGTH             equ 0007h
SSP1DATPPS_SSP1DATPPS_MASK               equ 007Fh
SSP1DATPPS_SSP1DATPPS0_POSN              equ 0000h
SSP1DATPPS_SSP1DATPPS0_POSITION          equ 0000h
SSP1DATPPS_SSP1DATPPS0_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS0_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS0_MASK              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSN              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSITION          equ 0001h
SSP1DATPPS_SSP1DATPPS1_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS1_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS1_MASK              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSN              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSITION          equ 0002h
SSP1DATPPS_SSP1DATPPS2_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS2_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS2_MASK              equ 0004h
SSP1DATPPS_SSP1DATPPS3_POSN              equ 0003h
SSP1DATPPS_SSP1DATPPS3_POSITION          equ 0003h
SSP1DATPPS_SSP1DATPPS3_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS3_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS3_MASK              equ 0008h
SSP1DATPPS_SSP1DATPPS4_POSN              equ 0004h
SSP1DATPPS_SSP1DATPPS4_POSITION          equ 0004h
SSP1DATPPS_SSP1DATPPS4_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS4_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS4_MASK              equ 0010h
SSP1DATPPS_SSP1DATPPS5_POSN              equ 0005h
SSP1DATPPS_SSP1DATPPS5_POSITION          equ 0005h
SSP1DATPPS_SSP1DATPPS5_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS5_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS5_MASK              equ 0020h

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 01E49h
// bitfield definitions
SSP1SSPPS_SSP1SSPPS_POSN                 equ 0000h
SSP1SSPPS_SSP1SSPPS_POSITION             equ 0000h
SSP1SSPPS_SSP1SSPPS_SIZE                 equ 0007h
SSP1SSPPS_SSP1SSPPS_LENGTH               equ 0007h
SSP1SSPPS_SSP1SSPPS_MASK                 equ 007Fh
SSP1SSPPS_SSP1SSPPS0_POSN                equ 0000h
SSP1SSPPS_SSP1SSPPS0_POSITION            equ 0000h
SSP1SSPPS_SSP1SSPPS0_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS0_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS0_MASK                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSN                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSITION            equ 0001h
SSP1SSPPS_SSP1SSPPS1_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS1_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS1_MASK                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSN                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSITION            equ 0002h
SSP1SSPPS_SSP1SSPPS2_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS2_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS2_MASK                equ 0004h
SSP1SSPPS_SSP1SSPPS3_POSN                equ 0003h
SSP1SSPPS_SSP1SSPPS3_POSITION            equ 0003h
SSP1SSPPS_SSP1SSPPS3_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS3_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS3_MASK                equ 0008h
SSP1SSPPS_SSP1SSPPS4_POSN                equ 0004h
SSP1SSPPS_SSP1SSPPS4_POSITION            equ 0004h
SSP1SSPPS_SSP1SSPPS4_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS4_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS4_MASK                equ 0010h
SSP1SSPPS_SSP1SSPPS5_POSN                equ 0005h
SSP1SSPPS_SSP1SSPPS5_POSITION            equ 0005h
SSP1SSPPS_SSP1SSPPS5_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS5_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS5_MASK                equ 0020h

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
SSP2CLKPPS                               equ 01E4Ah
// bitfield definitions
SSP2CLKPPS_SSP2CLKPPS_POSN               equ 0000h
SSP2CLKPPS_SSP2CLKPPS_POSITION           equ 0000h
SSP2CLKPPS_SSP2CLKPPS_SIZE               equ 0007h
SSP2CLKPPS_SSP2CLKPPS_LENGTH             equ 0007h
SSP2CLKPPS_SSP2CLKPPS_MASK               equ 007Fh

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
SSP2DATPPS                               equ 01E4Bh
// bitfield definitions
SSP2DATPPS_SSP2DATPPS_POSN               equ 0000h
SSP2DATPPS_SSP2DATPPS_POSITION           equ 0000h
SSP2DATPPS_SSP2DATPPS_SIZE               equ 0007h
SSP2DATPPS_SSP2DATPPS_LENGTH             equ 0007h
SSP2DATPPS_SSP2DATPPS_MASK               equ 007Fh

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
SSP2SSPPS                                equ 01E4Ch
// bitfield definitions
SSP2SSPPS_SSP2SSPPS_POSN                 equ 0000h
SSP2SSPPS_SSP2SSPPS_POSITION             equ 0000h
SSP2SSPPS_SSP2SSPPS_SIZE                 equ 0007h
SSP2SSPPS_SSP2SSPPS_LENGTH               equ 0007h
SSP2SSPPS_SSP2SSPPS_MASK                 equ 007Fh

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
ADACTPPS                                 equ 01E50h
// bitfield definitions
ADACTPPS_ADACTPPS_POSN                   equ 0000h
ADACTPPS_ADACTPPS_POSITION               equ 0000h
ADACTPPS_ADACTPPS_SIZE                   equ 0007h
ADACTPPS_ADACTPPS_LENGTH                 equ 0007h
ADACTPPS_ADACTPPS_MASK                   equ 007Fh

