garyPenhook/PIC-Assembler/device_includes/pic16f17524.inc
#define APMCLK4                          BANKMASK(APMCLK), 4
#define APMCLK5                          BANKMASK(APMCLK), 5
#define APMCLK6                          BANKMASK(APMCLK), 6
#define APMCLK7                          BANKMASK(APMCLK), 7
#define APMEN                            BANKMASK(APMCON), 7
#define APMMD                            BANKMASK(PMD5), 2
#define APMPER0                          BANKMASK(APMPERL), 0
#define APMPER1                          BANKMASK(APMPERL), 1
#define APMPER10                         BANKMASK(APMPERH), 2
#define APMPER11                         BANKMASK(APMPERH), 3
#define APMPER12                         BANKMASK(APMPERH), 4
#define APMPER13                         BANKMASK(APMPERH), 5
#define APMPER14                         BANKMASK(APMPERH), 6
#define APMPER15                         BANKMASK(APMPERH), 7
#define APMPER2                          BANKMASK(APMPERL), 2
#define APMPER3                          BANKMASK(APMPERL), 3
#define APMPER4                          BANKMASK(APMPERL), 4
#define APMPER5                          BANKMASK(APMPERL), 5
#define APMPER6                          BANKMASK(APMPERL), 6
#define APMPER7                          BANKMASK(APMPERL), 7
#define APMPER8                          BANKMASK(APMPERH), 0
#define APMPER9                          BANKMASK(APMPERH), 1
#define APMPERE1_10                      BANKMASK(APMPERE1H), 2
#define APMPERE1_11                      BANKMASK(APMPERE1H), 3
#define APMPERE1_13                      BANKMASK(APMPERE1H), 5
#define APMPERE1_14                      BANKMASK(APMPERE1H), 6
#define APMPERE1_15                      BANKMASK(APMPERE1H), 7
#define APMPERE1_2                       BANKMASK(APMPERE1L), 2
#define APMPERE1_3                       BANKMASK(APMPERE1L), 3
#define APMPERE1_4                       BANKMASK(APMPERE1L), 4
#define APMPERE1_5                       BANKMASK(APMPERE1L), 5
#define APMPERE1_6                       BANKMASK(APMPERE1L), 6
#define APMPERE1_7                       BANKMASK(APMPERE1L), 7
#define APMPERE1_8                       BANKMASK(APMPERE1H), 0
#define APMPERE2_10                      BANKMASK(APMPERE2H), 2
#define APMPERE2_11                      BANKMASK(APMPERE2H), 3
#define APMPERE2_13                      BANKMASK(APMPERE2H), 5
#define APMPERE2_14                      BANKMASK(APMPERE2H), 6
#define APMPERE2_15                      BANKMASK(APMPERE2H), 7
#define APMPERE2_2                       BANKMASK(APMPERE2L), 2
#define APMPERE2_3                       BANKMASK(APMPERE2L), 3
#define APMPERE2_4                       BANKMASK(APMPERE2L), 4
#define APMPERE2_5                       BANKMASK(APMPERE2L), 5
#define APMPERE2_6                       BANKMASK(APMPERE2L), 6
#define APMPERE2_7                       BANKMASK(APMPERE2L), 7
#define APMPERE2_8                       BANKMASK(APMPERE2H), 0
#define APMPRE0                          BANKMASK(APMPREL), 0
#define APMPRE1                          BANKMASK(APMPREL), 1
#define APMPRE10                         BANKMASK(APMPREH), 2
#define APMPRE11                         BANKMASK(APMPREH), 3
#define APMPRE12                         BANKMASK(APMPREH), 4
#define APMPRE13                         BANKMASK(APMPREH), 5
#define APMPRE14                         BANKMASK(APMPREH), 6
#define APMPRE15                         BANKMASK(APMPREH), 7
#define APMPRE2                          BANKMASK(APMPREL), 2
#define APMPRE3                          BANKMASK(APMPREL), 3
#define APMPRE4                          BANKMASK(APMPREL), 4
#define APMPRE5                          BANKMASK(APMPREL), 5
#define APMPRE6                          BANKMASK(APMPREL), 6
#define APMPRE7                          BANKMASK(APMPREL), 7
#define APMPRE8                          BANKMASK(APMPREH), 0
#define APMPRE9                          BANKMASK(APMPREH), 1
#define APMSTATUS_10                     BANKMASK(APMSTATUSH), 2
#define APMSTATUS_11                     BANKMASK(APMSTATUSH), 3
#define APMSTATUS_13                     BANKMASK(APMSTATUSH), 5
#define APMSTATUS_14                     BANKMASK(APMSTATUSH), 6
#define APMSTATUS_15                     BANKMASK(APMSTATUSH), 7
#define APMSTATUS_2                      BANKMASK(APMSTATUSL), 2
#define APMSTATUS_3                      BANKMASK(APMSTATUSL), 3
#define APMSTATUS_4                      BANKMASK(APMSTATUSL), 4
#define APMSTATUS_5                      BANKMASK(APMSTATUSL), 5
#define APMSTATUS_6                      BANKMASK(APMSTATUSL), 6
#define APMSTATUS_7                      BANKMASK(APMSTATUSL), 7
#define APMSTATUS_8                      BANKMASK(APMSTATUSH), 0
#define AS0E                             BANKMASK(CWG1AS1), 0
#define AS1E                             BANKMASK(CWG1AS1), 1
#define AS2E                             BANKMASK(CWG1AS1), 2
#define AS3E                             BANKMASK(CWG1AS1), 3
#define AS4E                             BANKMASK(CWG1AS1), 4
#define AS5E                             BANKMASK(CWG1AS1), 5
#define AS6E                             BANKMASK(CWG1AS1), 6
#define AS7E                             BANKMASK(CWG1AS1), 7
#define ASYNC                            BANKMASK(T0CON1), 4
#define BCL1IE                           BANKMASK(PIE5), 3
#define BCL1IF                           BANKMASK(PIR5), 3
#define BCL2IE                           BANKMASK(PIE5), 5
#define BCL2IF                           BANKMASK(PIR5), 5
#define BF1                              BANKMASK(SSP1STAT), 0
#define BF2                              BANKMASK(SSP2STAT), 0
#define BORRDY                           BANKMASK(BORCON), 0
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BSR5                             BANKMASK(BSR), 5
#define C1EN                             BANKMASK(CM1CON0), 7
#define C1HYS0                           BANKMASK(CM1CON0), 1
#define C1HYS1                           BANKMASK(CM1CON0), 2
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NCH), 0
#define C1NCH1                           BANKMASK(CM1NCH), 1
#define C1NCH2                           BANKMASK(CM1NCH), 2
#define C1PCH0                           BANKMASK(CM1PCH), 0
#define C1PCH1                           BANKMASK(CM1PCH), 1
#define C1PCH2                           BANKMASK(CM1PCH), 2
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1RDY                            BANKMASK(CM1CON1), 7
#define C1SP0                            BANKMASK(CM1CON1), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define CAL01                            BANKMASK(TMR1L), 0
#define CAL03                            BANKMASK(TMR3L), 0
#define CAL11                            BANKMASK(TMR1L), 1
#define CAL13                            BANKMASK(TMR3L), 1
#define CAL21                            BANKMASK(TMR1L), 2
#define CAL23                            BANKMASK(TMR3L), 2
#define CAL31                            BANKMASK(TMR1L), 3
#define CAL33                            BANKMASK(TMR3L), 3
#define CAL41                            BANKMASK(TMR1L), 4
#define CAL43                            BANKMASK(TMR3L), 4
#define CAL51                            BANKMASK(TMR1L), 5
#define CAL53                            BANKMASK(TMR3L), 5
#define CAL61                            BANKMASK(TMR1L), 6
#define CAL63                            BANKMASK(TMR3L), 6
#define CAL71                            BANKMASK(TMR1L), 7
#define CAL73                            BANKMASK(TMR3L), 7
#define CALC0                            BANKMASK(ADCON3), 4
#define CALC1                            BANKMASK(ADCON3), 5
#define CALC2                            BANKMASK(ADCON3), 6
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE2), 5
#define CCP1IF                           BANKMASK(PIR2), 5
#define CCP1MD                           BANKMASK(PMD1), 5
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP1PPS5                         BANKMASK(CCP1PPS), 5
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE2), 6
#define CCP2IF                           BANKMASK(PIR2), 6
#define CCP2MD                           BANKMASK(PMD1), 6
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CCP2PPS5                         BANKMASK(CCP2PPS), 5
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CDIV0                            BANKMASK(OSCCON2), 0
#define CDIV1                            BANKMASK(OSCCON2), 1
#define CDIV2                            BANKMASK(OSCCON2), 2
#define CDIV3                            BANKMASK(OSCCON2), 3
#define CGA0                             BANKMASK(ADCG1A), 0
#define CGA1                             BANKMASK(ADCG1A), 1
#define CGA2                             BANKMASK(ADCG1A), 2
#define CGA4                             BANKMASK(ADCG1A), 4
#define CGA5                             BANKMASK(ADCG1A), 5
#define CGC0                             BANKMASK(ADCG1C), 0
#define CGC1                             BANKMASK(ADCG1C), 1
#define CGC2                             BANKMASK(ADCG1C), 2
#define CGC3                             BANKMASK(ADCG1C), 3
#define CGC4                             BANKMASK(ADCG1C), 4
#define CGC5                             BANKMASK(ADCG1C), 5
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKE2                             BANKMASK(SSP2STAT), 6
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CKP2                             BANKMASK(SSP2CON1), 4
#define CKPS3                            BANKMASK(T0CON1), 3
#define CKS0                             BANKMASK(NCO1CLK), 0
#define CKS1                             BANKMASK(NCO1CLK), 1
#define CKS2                             BANKMASK(NCO1CLK), 2
#define CKS3                             BANKMASK(NCO1CLK), 3
#define CLC1IE                           BANKMASK(PIE4), 2
#define CLC1IF                           BANKMASK(PIR4), 2
#define CLC1MD                           BANKMASK(PMD2), 3
#define CLC1OUT                          BANKMASK(CLCDATA), 0
#define CLC2IE                           BANKMASK(PIE4), 3
#define CLC2IF                           BANKMASK(PIR4), 3
#define CLC2MD                           BANKMASK(PMD2), 4
#define CLC2OUT                          BANKMASK(CLCDATA), 1
#define CLC3IE                           BANKMASK(PIE4), 4
#define CLC3IF                           BANKMASK(PIR4), 4
#define CLC3MD                           BANKMASK(PMD2), 5
#define CLC3OUT                          BANKMASK(CLCDATA), 2
#define CLC4IE                           BANKMASK(PIE4), 5
#define CLC4IF                           BANKMASK(PIR4), 5
#define CLC4MD                           BANKMASK(PMD2), 6
#define CLC4OUT                          BANKMASK(CLCDATA), 3
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN0PPS5                       BANKMASK(CLCIN0PPS), 5
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN1PPS5                       BANKMASK(CLCIN1PPS), 5
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN2PPS5                       BANKMASK(CLCIN2PPS), 5
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CLCIN3PPS5                       BANKMASK(CLCIN3PPS), 5
#define CLKEN                            BANKMASK(PORTWCON), 0
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3
#define CLKRDC0                          BANKMASK(CLKRCON), 3
#define CLKRDC1                          BANKMASK(CLKRCON), 4
#define CLKRDIV0                         BANKMASK(CLKRCON), 0
#define CLKRDIV1                         BANKMASK(CLKRCON), 1
#define CLKRDIV2                         BANKMASK(CLKRCON), 2
#define CLKREN                           BANKMASK(CLKRCON), 7
#define CLKRMD                           BANKMASK(PMD0), 6
#define CLP1CMR0                         BANKMASK(CMLP1CON1), 4
#define CLP1CMR1                         BANKMASK(CMLP1CON1), 5
#define CLP1EN                           BANKMASK(CMLP1CON0), 7
#define CLP1INTN                         BANKMASK(CMLP1CON1), 0
#define CLP1INTP                         BANKMASK(CMLP1CON1), 1
#define CLP1NCH0                         BANKMASK(CMLP1NCH), 0
#define CLP1NCH1                         BANKMASK(CMLP1NCH), 1
#define CLP1NCH2                         BANKMASK(CMLP1NCH), 2
#define CLP1PCH0                         BANKMASK(CMLP1PCH), 0
#define CLP1PCH1                         BANKMASK(CMLP1PCH), 1
#define CLP1PCH2                         BANKMASK(CMLP1PCH), 2
#define CLP1POL                          BANKMASK(CMLP1CON0), 4
#define CLP1SYNC                         BANKMASK(CMLP1CON0), 0
#define CM1IE                            BANKMASK(PIE5), 6
#define CM1IF                            BANKMASK(PIR5), 6
#define CM1MD                            BANKMASK(PMD3), 6
#define CMLP1IE                          BANKMASK(PIE5), 7
#define CMLP1IF                          BANKMASK(PIR5), 7
#define CMLP1MD                          BANKMASK(PMD3), 7
#define CMR0                             BANKMASK(CMLP1CON1), 4
#define CMR1                             BANKMASK(CMLP1CON1), 5
#define CNT0                             BANKMASK(ADCNT), 0
#define CNT1                             BANKMASK(ADCNT), 1
#define CNT2                             BANKMASK(ADCNT), 2
#define CNT3                             BANKMASK(ADCNT), 3
#define CNT4                             BANKMASK(ADCNT), 4
#define CNT5                             BANKMASK(ADCNT), 5
#define CNT6                             BANKMASK(ADCNT), 6
#define CNT7                             BANKMASK(ADCNT), 7
#define CONT                             BANKMASK(ADCON0), 6
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CPOS                             BANKMASK(CPCON), 5
#define CPRDY                            BANKMASK(CPCON), 0
#define CPREQ                            BANKMASK(CPCON), 2
#define CPT                              BANKMASK(CPCON), 1
#define CRCBUSY                          BANKMASK(CRCCON0), 5
#define CRCEN                            BANKMASK(CRCCON0), 7
#define CRCGO                            BANKMASK(CRCCON0), 6
#define CRCIE                            BANKMASK(PIE1), 1
#define CRCIF                            BANKMASK(PIR1), 1
#define CRCMD                            BANKMASK(PMD0), 1
#define CRS0                             BANKMASK(ADCON2), 4
#define CRS1                             BANKMASK(ADCON2), 5
#define CRS2                             BANKMASK(ADCON2), 6
#define CS                               BANKMASK(CWG1CLK), 0
#define CS5                              BANKMASK(ADCLK), 5
#define CSWHOLD                          BANKMASK(OSCCON3), 7
#define CSWIE                            BANKMASK(PIE1), 4
#define CSWIF                            BANKMASK(PIR1), 4
#define CWG1CS                           BANKMASK(CWG1CLK), 0
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IE                           BANKMASK(PIE4), 1
#define CWG1IF                           BANKMASK(PIR4), 1
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MD                           BANKMASK(PMD2), 2
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OVRA                         BANKMASK(CWG1STR), 4
#define CWG1OVRB                         BANKMASK(CWG1STR), 5
#define CWG1OVRC                         BANKMASK(CWG1STR), 6
#define CWG1OVRD                         BANKMASK(CWG1STR), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1PPS0                         BANKMASK(CWG1PPS), 0
#define CWG1PPS1                         BANKMASK(CWG1PPS), 1
#define CWG1PPS2                         BANKMASK(CWG1PPS), 2
#define CWG1PPS3                         BANKMASK(CWG1PPS), 3
#define CWG1PPS4                         BANKMASK(CWG1PPS), 4
#define CWG1PPS5                         BANKMASK(CWG1PPS), 5
#define CWG1STRA                         BANKMASK(CWG1STR), 0
#define CWG1STRB                         BANKMASK(CWG1STR), 1
#define CWG1STRC                         BANKMASK(CWG1STR), 2
#define CWG1STRD                         BANKMASK(CWG1STR), 3
#define D1S0                             BANKMASK(CLCnSEL0), 0
#define D1S1                             BANKMASK(CLCnSEL0), 1
#define D1S2                             BANKMASK(CLCnSEL0), 2
#define D1S3                             BANKMASK(CLCnSEL0), 3
#define D1S4                             BANKMASK(CLCnSEL0), 4
#define D1S5                             BANKMASK(CLCnSEL0), 5
#define D1S6                             BANKMASK(CLCnSEL0), 6
#define D2S0                             BANKMASK(CLCnSEL1), 0
#define D2S1                             BANKMASK(CLCnSEL1), 1
#define D2S2                             BANKMASK(CLCnSEL1), 2
#define D2S3                             BANKMASK(CLCnSEL1), 3
#define D2S4                             BANKMASK(CLCnSEL1), 4
#define D2S5                             BANKMASK(CLCnSEL1), 5
#define D2S6                             BANKMASK(CLCnSEL1), 6
#define D3S0                             BANKMASK(CLCnSEL2), 0
#define D3S1                             BANKMASK(CLCnSEL2), 1
#define D3S2                             BANKMASK(CLCnSEL2), 2
#define D3S3                             BANKMASK(CLCnSEL2), 3
#define D3S4                             BANKMASK(CLCnSEL2), 4
#define D3S5                             BANKMASK(CLCnSEL2), 5
#define D3S6                             BANKMASK(CLCnSEL2), 6
#define D4S0                             BANKMASK(CLCnSEL3), 0
#define D4S1                             BANKMASK(CLCnSEL3), 1
#define D4S2                             BANKMASK(CLCnSEL3), 2
#define D4S3                             BANKMASK(CLCnSEL3), 3
#define D4S4                             BANKMASK(CLCnSEL3), 4
#define D4S5                             BANKMASK(CLCnSEL3), 5
#define D4S6                             BANKMASK(CLCnSEL3), 6
#define DA1                              BANKMASK(SSP1STAT), 5
#define DA2                              BANKMASK(SSP2STAT), 5
#define DABORT                           BANKMASK(SCANCON0), 4
#define DAC1MD                           BANKMASK(PMD4), 1
#define DAC2MD                           BANKMASK(PMD4), 2
#define DAT0                             BANKMASK(CWG1ISM), 0
#define DAT1                             BANKMASK(CWG1ISM), 1
#define DAT2                             BANKMASK(CWG1ISM), 2
#define DAT3                             BANKMASK(CWG1ISM), 3
#define DAT4                             BANKMASK(CWG1ISM), 4
#define DATA0                            BANKMASK(CRCDATAL), 0
#define DATA1                            BANKMASK(CRCDATAL), 1
#define DATA10                           BANKMASK(CRCDATAH), 2
#define DATA11                           BANKMASK(CRCDATAH), 3
#define DATA12                           BANKMASK(CRCDATAH), 4
